ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    return status;
}


// Init advertisment

static uint8_t              m_adv_handle    = BLE_GAP_ADV_SET_HANDLE_NOT_SET; /**< Advertising handle used to identify an advertising set. */
static ble_gap_adv_data_t   m_adv_data      = {0};

static ret_code_t advertisement_2_init(void)
{
    ret_code_t              status      = NRF_SUCCESS;
    ble_advdata_t           advdata     = {0};
    ble_advdata_t           srdata      = {0};
    ble_gap_adv_params_t    adv_params  = {0};


    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = false;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    if ( NRF_SUCCESS != ble_advdata_encode( &advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len ))
    {
        // Further actions on error... 
        error_handler();  
    }

    adv_params.primary_phy      = BLE_GAP_PHY_CODED;
    adv_params.secondary_phy    = BLE_GAP_PHY_CODED;
    adv_params.properties.type  = BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;

    adv_params.duration         = (uint32_t) ( GAP_ADV_DURATION_MS / 10.0f );
    adv_params.interval         = (uint32_t) ( GAP_ADV_INTERVAL_MS / 0.625f );
    adv_params.p_peer_addr      = NULL;
    adv_params.filter_policy    = BLE_GAP_ADV_FP_ANY;

    if ( NRF_SUCCESS != sd_ble_gap_adv_set_configure( &m_adv_handle, &m_adv_data, &adv_params ))
    {
        // Further actions on error... 
        error_handler();  
    }

    if ( NRF_SUCCESS != sd_ble_gap_tx_power_set( BLE_GAP_TX_POWER_ROLE_ADV, m_adv_handle, 0 ))
    {
        // Further actions on error... 
        error_handler();  
    }

    return status;
}


static void advertisement_start(void)
{
    if ( NRF_SUCCESS != ble_advertising_start( &m_advertising, BLE_ADV_MODE_FAST ))
    {
        // Further actions on error... 
        error_handler();  
    }
}

static void advertisement_2_start(void)
{
    if ( NRF_SUCCESS != sd_ble_gap_adv_start( m_adv_handle, BLE_CONN_CFG_TAG ))
    {
        // Further actions on error... 
        error_handler();  
    }
}


static void nrf_qwr_error_hndl(uint32_t nrf_error)
{
    // Handler errors here...

}

// Init services
static ret_code_t services_init(void)
{
    ret_code_t          status      = NRF_SUCCESS;
    nrf_ble_qwr_init_t  qwr_init    = { 0 };

    // Register error hander
    qwr_init.error_handler = nrf_qwr_error_hndl;

    // Init QWR
    if ( NRF_SUCCESS != nrf_ble_qwr_init( &m_qwr, &qwr_init ))
    {
        // Further actions on error... 
        error_handler();    
    }

    return status;
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *
 * @note    All this function does is to disconnect. This could have been done by simply
 *          setting the disconnect_on_fail config parameter, but instead we use the event
 *          handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        
        // TODO: 
        //APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    // TODO: 
   // APP_ERROR_HANDLER(nrf_error);
}


// Init connection parameters
static ret_code_t conn_pars_init(void)
{
    ret_code_t              status  = NRF_SUCCESS;
    ble_conn_params_init_t  cp_init = {0};


    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    if ( NRF_SUCCESS != ble_conn_params_init( &cp_init ))
    {
        // Further actions on error... 
        error_handler();    
    }

    return status;
}



static ble_gatts_char_handles_t    char_handles    = {0};

#define THERMOSTAT_SERVICE_BASE                                                \
  {                                                                            \
    0x2A, 0x94, 0x01, 0x0a, 0x34, 0xc4, 0x3e, 0xbc, 0xe5, 0x4b, 0xb3, 0x8b,    \
        0x00, 0x00, 0x9d, 0xaf                                                 \
  }

#define THERMOSTAT_SERVICE_UUID   0x1000


#define BLE_THERMOSTAT_RX_CHARACTERISTIC   0x1001
#define BLE_THERMOSTAT_TX_CHARACTERISTIC   0x1002

static ble_gatts_char_handles_t    rx_char_handles    = {0};
static ble_gatts_char_handles_t    tx_char_handles    = {0};

static void custom_service_init(void)
{
    ble_uuid_t  hrs_uuid    = {0};
    uint16_t    hrs_handle  = 0;

    ///////////////////////////////////////////////////////////////////////////////////
    // Assing UUID 
    //BLE_UUID_BLE_ASSIGN( hrs_uuid, BLE_UUID_HEART_RATE_SERVICE );
    
    // Or EQUIVALENT
    hrs_uuid.type = BLE_UUID_TYPE_BLE;
    hrs_uuid.uuid = BLE_UUID_HEART_RATE_SERVICE;
    ///////////////////////////////////////////////////////////////////////////////////


    // Register service
    if ( NRF_SUCCESS != sd_ble_gatts_service_add( BLE_GATTS_SRVC_TYPE_PRIMARY, &hrs_uuid, &hrs_handle ))
    {
        // Further actions on error... 
        error_handler();  
    }

    
    ///////////////////////////////////////////////////////////////////////////////////
    // Add characteristics to service
    ble_add_char_params_t       char_params     = {0};


    uint8_t init_data[5] = { 0, 1, 2, 3, 4 };


