ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    char_params.uuid                = BLE_UUID_HEART_RATE_MEASUREMENT_CHAR;
    char_params.max_len             = 20;
    char_params.init_len            = 5;
    char_params.is_var_len          = true;
    char_params.char_props.notify   = 1;
    char_params.cccd_write_access   = SEC_OPEN;
    char_params.p_init_value        = (uint8_t*) &init_data;



    // Register characteristics
    if ( NRF_SUCCESS != characteristic_add( hrs_handle, &char_params, &char_handles ))
    {
        // Further actions on error... 
        error_handler();  
    }





    ////////////////////////////////////////////////////////////////////////////////////////////////////
    //          HOW TO MAKE CUSTOM SERVICE AND CHARACTERISTICS ???????????????

    uint32_t            err_code;
    ble_uuid_t          char_uuid;
    ble_uuid128_t       base_uuid = THERMOSTAT_SERVICE_BASE;
    uint16_t            custom_service_handle  = 0;


    char_uuid.uuid      = THERMOSTAT_SERVICE_UUID;

    if ( NRF_SUCCESS != sd_ble_uuid_vs_add( &base_uuid, &char_uuid.type ))
    {
        // Further actions on error... 
        error_handler();  
    }

    // Register service
    if ( NRF_SUCCESS != sd_ble_gatts_service_add( BLE_GATTS_SRVC_TYPE_PRIMARY, &char_uuid, &custom_service_handle ))
    {
        // Further actions on error... 
        error_handler();  
    }


    // Add RX characteristics
    ble_add_char_params_t rx_char_params = {0};

    rx_char_params.uuid                     = BLE_THERMOSTAT_RX_CHARACTERISTIC;
    rx_char_params.uuid_type                = char_uuid.type;
    rx_char_params.init_len                 = sizeof(uint8_t);
    rx_char_params.max_len                  = 250;
    rx_char_params.is_var_len               = true;
    rx_char_params.char_props.write         = 1;
    rx_char_params.char_props.write_wo_resp = 1;
    rx_char_params.read_access              = SEC_OPEN;
    rx_char_params.write_access             = SEC_OPEN;
    rx_char_params.cccd_write_access        = SEC_OPEN;

    // Register characteristics
    if ( NRF_SUCCESS != characteristic_add( custom_service_handle, &rx_char_params, &rx_char_handles ))
    {
        // Further actions on error... 
        error_handler();  
    }

    
    // Add Tx characteristics
    ble_add_char_params_t tx_char_params = {0};

    tx_char_params.uuid                     = BLE_THERMOSTAT_TX_CHARACTERISTIC;
    tx_char_params.uuid_type                = char_uuid.type;
    tx_char_params.init_len                 = sizeof(uint8_t);
    tx_char_params.max_len                  = 250;
    tx_char_params.is_var_len               = true;
    tx_char_params.char_props.write         = 0;
    tx_char_params.char_props.write_wo_resp = 0;
    tx_char_params.char_props.read          = 0;
    tx_char_params.char_props.notify        = 1;
    tx_char_params.read_access              = SEC_OPEN;
    tx_char_params.write_access             = SEC_OPEN;
    tx_char_params.cccd_write_access        = SEC_OPEN;

    // Register characteristics
    if ( NRF_SUCCESS != characteristic_add( custom_service_handle, &tx_char_params, &tx_char_handles))
    {
        // Further actions on error... 
        error_handler();  
    }

}





/**
 *      BLE HANDLER
 */
static void ble_evt_hndl(ble_evt_t const * p_ble_evt, void * p_context)
{
    
    switch( p_ble_evt->header.evt_id )
    {
        case BLE_GAP_EVT_DISCONNECTED:
        
            // Status
           // bsp_board_led_off( BSP_BOARD_LED_1 );
            led_set( eLED_2, eLED_OFF );


            break;


        case BLE_GAP_EVT_CONNECTED:

            led_set( eLED_2, eLED_ON );
            
            // Status 
            //bsp_board_led_on( BSP_BOARD_LED_1 );

            // Assing connection info to handle
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

            if ( NRF_SUCCESS != nrf_ble_qwr_conn_handle_assign( &m_qwr, m_conn_handle ))
            {
                error_handler();
            }

            break;


        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
            
            const ble_gap_phys_t phys = 
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };

            if ( NRF_SUCCESS != sd_ble_gap_phy_update( p_ble_evt->evt.gap_evt.conn_handle, &phys))
            {
                error_handler();
            }

            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            ret_code_t err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;


        case BLE_GATTS_EVT_WRITE:

           // bsp_board_led_invert( BSP_BOARD_LED_3 );

            // Client write to RX characteristics?
            if ( p_ble_evt->evt.gatts_evt.params.write.handle == rx_char_handles.value_handle )
            {
               
                // Get data and lenght
                const uint8_t * p_data  = p_ble_evt->evt.gatts_evt.params.write.data;
                const uint16_t len      = p_ble_evt->evt.gatts_evt.params.write.len;

                // Test code
                if ( p_data[0] == 0xAA )
                {
                   // bsp_board_led_invert( BSP_BOARD_LED_1 );
                }
            }

        break;

        default:
            // No actions...
            break;
    }
}







////////////////////////////////////////////////////////////////////////////////
/**
* @} <!-- END GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/**
*@addtogroup BLE_P_API
* @{ <!-- BEGIN GROUP -->
*
* 	Following function are part of BLE Peripheral API.
*/
////////////////////////////////////////////////////////////////////////////////





ble_p_status_t ble_p_init(void)
{
    ble_p_status_t status = eBLE_P_OK;

    // Init BLE stuff
    ble_stack_init();
    gap_init();
    gatt_init();
    
    advertisement_init();
    //advertisement_2_init();
    
    services_init();
    conn_pars_init(); 


    custom_service_init();


    // Start advertising     
    advertisement_start();


