ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral get init status
*
* @param[out] 	p_is_conn   - Connection status, true if initiated
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_is_init (bool * const p_is_init)
{
    ble_p_status_t status = eBLE_P_OK;

    if ( NULL != p_is_init )
    {
        *p_is_init = gb_is_init;
    }
    else
    {
        status = eBLE_P_ERROR;
    }

    return status;  
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral get connection status
*
* @param[out] 	p_is_conn   - Connection status, true if connected
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_is_connected(bool * const p_is_conn)
{
    ble_p_status_t status = eBLE_P_OK;

    if ( NULL != p_is_conn )
    {
        // TODO: Return connectiojn status
    }
    else
    {
        status = eBLE_P_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral write 
*	
* @note     This function push data to GATTS Tx characteristics.
*
* @note     Tx characteristics is defined as server-initiated update with
*           "Notification" type. 
*
* @note     This function shall not be called if connection is not established!
*
* @param[in] 	p_data      - Pointer to data for transmit
* @param[in] 	len         - Lenght of data in bytes
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_write(const uint8_t * const p_data, const uint16_t len)
{
    ble_p_status_t status = eBLE_P_OK;

    // TODO: Assert if connection is not established!!!

    // TODO: ...

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral read
*	
* @note     This function retrives data from GATTS Rx characteristics.
*
* @note     Rx characteristics is defined as read-only, therefore only client
*           can write to characteristics value.
*
* @note     This function shall not be called if connection is not established!
*
* @note     Returned data is taken from local FIFO buffer storage. In case reception
*           FIFO is empty it return ERROR code, otherwise OK.
*
* @param[out] 	p_data      - Pointer to data for transmit
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_get(uint8_t * const p_data)
{
    ble_p_status_t status = eBLE_P_OK;

    // TODO: Assert if connection is not established!!!

    // TODO: ...

    return status;
}














void ble_p_hndl(void)
{
    
    static uint8_t                encoded_hrm[5] = { 0, 1, 2, 3};
    uint16_t               len;
    uint16_t               hvx_len;
    ble_gatts_hvx_params_t hvx_params = {0};

    len     = 5;
    hvx_len = len;


    // To HRV characteristics
    hvx_params.handle = char_handles.value_handle;   
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
    hvx_params.offset = 0;
    hvx_params.p_len  = &hvx_len;
    hvx_params.p_data = encoded_hrm;



    static uint8_t data[250] = {0};
    uint16_t len2 = 250;

    // ZIGA (10.01.2023): MTU is set to 250, effectively can exchange up to 244 bytes!
    data[0]++;
    data[243]++;

    ble_gatts_hvx_params_t hvx_params_tx = 
    {
        .handle     = tx_char_handles.value_handle,
        .p_data     = (uint8_t*) &data,
        .p_len      = &len2,
        .type       = BLE_GATT_HVX_NOTIFICATION
    };



    // Send value if connected and notifying
    if ( m_conn_handle != BLE_CONN_HANDLE_INVALID )
    {

        encoded_hrm[4]++;
        encoded_hrm[0]--;

        // Send data
        ret_code_t status = NRF_SUCCESS;
        
        // Send
        status = sd_ble_gatts_hvx( m_conn_handle, &hvx_params );

        //if ( NRF_SUCCESS != sd_ble_gatts_hvx( m_conn_handle, &hvx_params ))
        if ( NRF_SUCCESS != status )
        {
            // Further actions on error... 
            //error_handler();  

            //err_cnt++;
        }
        

        
        status = sd_ble_gatts_hvx( m_conn_handle, &hvx_params_tx );

        if ( NRF_SUCCESS != status )
        {
            // Further actions on error... 
            //error_handler();  

            //err_cnt++;
        }
        

    }


    led_toggle( eLED_3 );
}





////////////////////////////////////////////////////////////////////////////////
/**
* @} <!-- END GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////
